tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1769_tdd.h
#define ANSELA                        522
#define ANSA0                         523
#define ANSA1                         524
#define ANSA2                         525
#define ANSA4                         526
#define ANSELB                        527
#define ANSB4                         528
#define ANSB5                         529
#define ANSB6                         530
#define ANSB7                         531
#define ANSELC                        532
#define ANSC0                         533
#define ANSC1                         534
#define ANSC2                         535
#define ANSC3                         536
#define ANSC6                         537
#define ANSC7                         538
#define PMADRL                        539
#define PMADRH                        540
#define PMDATL                        541
#define PMDATH                        542
#define PMCON1                        543
#define RD                            544
#define WR                            545
#define WREN                          546
#define WRERR                         547
#define FREE                          548
#define LWLO                          549
#define CFGS                          550
#define PMCON2                        551
#define RC1REG                        552
#define TX1REG                        553
#define SP1BRGL                       554
#define SP1BRGH                       555
#define RC1STA                        556
#define RX9D                          557
#define OERR                          558
#define FERR                          559
#define ADDEN                         560
#define CREN                          561
#define SREN                          562
#define RX9                           563
#define SPEN                          564
#define TX1STA                        565
#define TX9D                          566
#define TRMT                          567
#define BRGH                          568
#define SENDB                         569
#define TX1STA_SYNC                   570
#define TXEN                          571
#define TX9                           572
#define CSRC                          573
#define BAUD1CON                      574
#define ABDEN                         575
#define WUE                           576
#define BRG16                         577
#define SCKP                          578
#define RCIDL                         579
#define ABDOVF                        580
#define WPUA                          581
#define WPUA0                         582
#define WPUA1                         583
#define WPUA2                         584
#define WPUA3                         585
#define WPUA4                         586
#define WPUA5                         587
#define WPUB                          588
#define WPUB4                         589
#define WPUB5                         590
#define WPUB6                         591
#define WPUB7                         592
#define WPUC                          593
#define WPUC0                         594
#define WPUC1                         595
#define WPUC2                         596
#define WPUC3                         597
#define WPUC4                         598
#define WPUC5                         599
#define WPUC6                         600
#define WPUC7                         601
#define SSP1BUF                       602
#define BUF                           603
#define BUF0                          604
#define SSP1BUF0                      605
#define BUF1                          606
#define SSP1BUF1                      607
#define BUF2                          608
#define SSP1BUF2                      609
#define BUF3                          610
#define SSP1BUF3                      611
#define BUF4                          612
#define SSP1BUF4                      613
#define BUF5                          614
#define SSP1BUF5                      615
#define BUF6                          616
#define SSP1BUF6                      617
#define BUF7                          618
#define SSP1BUF7                      619
#define ADD0                          620
#define ADD                           621
#define SSP1ADD0                      622
#define SSP1ADD                       623
#define ADD1                          624
#define SSP1ADD1                      625
#define ADD2                          626
#define SSP1ADD2                      627
#define ADD3                          628
#define SSP1ADD3                      629
#define ADD4                          630
#define SSP1ADD4                      631
#define ADD5                          632
#define SSP1ADD5                      633
#define ADD6                          634
#define SSP1ADD6                      635
#define ADD7                          636
#define SSP1ADD7                      637
#define SSP1MSK0                      638
#define SSP1MSK                       639
#define MSK0                          640
#define MSK                           641
#define SSP1MSK1                      642
#define MSK1                          643
#define SSP1MSK2                      644
#define MSK2                          645
#define SSP1MSK3                      646
#define MSK3                          647
#define SSP1MSK4                      648
#define MSK4                          649
#define SSP1MSK5                      650
#define MSK5                          651
#define SSP1MSK6                      652
#define MSK6                          653
#define SSP1MSK7                      654
#define MSK7                          655
#define SSP1STAT                      656
#define BF                            657
#define UA                            658
#define R_nW                          659
#define S                             660
#define P                             661
#define D_nA                          662
#define CKE                           663
#define SMP                           664
#define SSP1CON1                      665
#define SSPM0                         666
#define SSPM                          667
#define SSPM1                         668
#define SSPM2                         669
#define SSPM3                         670
#define CKP                           671
#define SSPEN                         672
#define SSPOV                         673
#define WCOL                          674
#define SSP1CON2                      675
#define SEN                           676
#define RSEN                          677
#define PEN                           678
#define RCEN                          679
#define ACKEN                         680
#define ACKDT                         681
#define ACKSTAT                       682
#define GCEN                          683
#define SSP1CON3                      684
#define DHEN                          685
#define AHEN                          686
#define SBCDE                         687
#define SDAHT                         688
#define BOEN                          689
#define SCIE                          690
#define PCIE                          691
#define ACKTIM                        692
#define BORCON                        693
#define BORRDY                        694
#define BORFS                         695
#define SBOREN                        696
#define FVRCON                        697
#define ADFVR                         698
#define CDAFVR                        699
#define TSRNG                         700
#define TSEN                          701
#define FVRRDY                        702
#define FVREN                         703
#define ZCD1CON                       704
#define ZCD1INTN                      705
#define ZCD1INTP                      706
#define ZCD1POL                       707
#define ZCD1OUT                       708
#define ZCD1EN                        709
#define ODCONA                        710
#define ODA0                          711
#define ODA1                          712
#define ODA2                          713
#define ODA4                          714
#define ODA5                          715
#define ODCONB                        716
#define ODB4                          717
#define ODB5                          718
#define ODB6                          719
#define ODB7                          720
#define ODCONC                        721
#define ODC0                          722
#define ODC1                          723
#define ODC2                          724
#define ODC3                          725
#define ODC4                          726
#define ODC5                          727
#define ODC6                          728
#define ODC7                          729
#define CCPR1L                        730
#define CCPR1L_RL                     731
#define CCPR1H                        732
#define CCPR1H_RH                     733
#define CCP1CON                       734
#define CCP1MODE0                     735
#define CCP1CON_MODE0                 736
#define CCP1CON_MODE                  737
#define CCP1MODE                      738
#define CCP1MODE1                     739
#define CCP1CON_MODE1                 740
#define CCP1MODE2                     741
#define CCP1CON_MODE2                 742
#define CCP1MODE3                     743
#define CCP1CON_MODE3                 744
#define CCP1CON_FMT                   745
#define CCP1FMT                       746
#define CCP1CON_OUT                   747
#define CCP1OUT                       748
#define CCP1EN                        749
#define CCP1CON_EN                    750
#define CCP1CAP                       751
#define CCP1CTS0                      752
#define CCP1CAP_CTS                   753
#define CCP1CAP_CTS0                  754
#define CCP1CTS                       755
#define CCP1CTS1                      756
#define CCP1CAP_CTS1                  757
#define CCP1CTS2                      758
#define CCP1CAP_CTS2                  759
#define CCPR2L                        760
#define CCPR2L_RL                     761
#define CCPR2H                        762
#define CCPR2H_RH                     763
#define CCP2CON                       764
#define CCP2MODE                      765
#define CCP2MODE0                     766
#define CCP2CON_MODE0                 767
#define CCP2CON_MODE                  768
#define CCP2MODE1                     769
#define CCP2CON_MODE1                 770
#define CCP2MODE2                     771
#define CCP2CON_MODE2                 772
#define CCP2MODE3                     773
#define CCP2CON_MODE3                 774
#define CCP2FMT                       775
#define CCP2CON_FMT                   776
#define CCP2OUT                       777
#define CCP2CON_OUT                   778
#define CCP2EN                        779
#define CCP2CON_EN                    780
#define CCP2CAP                       781
#define CCP2CAP_CTS                   782
#define CCP2CAP_CTS0                  783
#define CCP2CTS                       784
#define CCP2CTS0                      785
#define CCP2CAP_CTS1                  786
#define CCP2CTS1                      787
#define CCP2CAP_CTS2                  788
#define CCP2CTS2                      789
#define CCPTMRS                       790
#define C1TSEL0                       791
#define C1TSEL                        792
#define C1TSEL1                       793
#define C2TSEL0                       794
#define C2TSEL                        795
#define C2TSEL1                       796
#define P3TSEL                        797
#define P3TSEL0                       798
#define P3TSEL1                       799
#define P4TSEL0                       800
#define P4TSEL                        801
#define P4TSEL1                       802
#define SLRCONA                       803
#define SLRA0                         804
#define SLRA1                         805
#define SLRA2                         806
#define SLRA4                         807
#define SLRA5                         808
#define SLRCONB                       809
#define SLRB4                         810
#define SLRB5                         811
#define SLRB6                         812
#define SLRB7                         813
#define SLRCONC                       814
#define SLRC0                         815
#define SLRC1                         816
#define SLRC2                         817
#define SLRC3                         818
#define SLRC4                         819
#define SLRC5                         820
#define SLRC6                         821
#define SLRC7                         822
#define MD2CON0                       823
#define MD2BIT                        824
#define MD2CON0_BIT                   825
#define MD2CON0_OPOL                  826
#define MD2OPOL                       827
#define MD2CON0_OUT                   828
#define MD2OUT                        829
#define MD2CON0_EN                    830
#define MD2EN                         831
#define MD2CON1                       832
#define MD2CLSYNC                     833
#define MD2CON1_CLSYNC                834
#define MD2CON1_CLPOL                 835
#define MD2CLPOL                      836
#define MD2CON1_CHSYNC                837
#define MD2CHSYNC                     838
#define MD2CHPOL                      839
#define MD2CON1_CHPOL                 840
#define MD2SRC                        841
#define MD2MS                         842
#define MD2MS0                        843
#define MD2SRC_MS0                    844
#define MD2SRC_MS                     845
#define MD2SRC_MS1                    846
#define MD2MS1                        847
#define MD2MS2                        848
#define MD2SRC_MS2                    849
#define MD2MS3                        850
#define MD2SRC_MS3                    851
#define MD2MS4                        852
#define MD2SRC_MS4                    853
#define MD2CARL                       854
#define MD2CARL_CL                    855
#define MD2CARL_CL0                   856
#define MD2CL0                        857
#define MD2CL                         858
#define MD2CARL_CL1                   859
#define MD2CL1                        860
#define MD2CL2                        861
#define MD2CARL_CL2                   862
#define MD2CL3                        863
#define MD2CARL_CL3                   864
#define MD2CARH                       865
#define MD2CARH_CH0                   866
#define MD2CH0                        867
#define MD2CARH_CH                    868
#define MD2CH                         869
#define MD2CARH_CH1                   870
#define MD2CH1                        871
#define MD2CARH_CH2                   872
#define MD2CH2                        873
#define MD2CARH_CH3                   874
#define MD2CH3                        875
#define INLVLA                        876
#define INLVLA0                       877
#define INLVLA1                       878
#define INLVLA2                       879
#define INLVLA3                       880
#define INLVLA4                       881
#define INLVLA5                       882
#define INLVLB                        883
#define INLVLB4                       884
#define INLVLB5                       885
#define INLVLB6                       886
#define INLVLB7                       887
#define INLVLC                        888
#define INLVLC0                       889
#define INLVLC1                       890
#define INLVLC2                       891
#define INLVLC3                       892
#define INLVLC4                       893
#define INLVLC5                       894
#define INLVLC6                       895
#define INLVLC7                       896
#define IOCAP                         897
#define IOCAP0                        898
#define IOCAP1                        899
#define IOCAP2                        900
#define IOCAP3                        901
#define IOCAP4                        902
#define IOCAP5                        903
#define IOCAN                         904
#define IOCAN0                        905
#define IOCAN1                        906
#define IOCAN2                        907
#define IOCAN3                        908
#define IOCAN4                        909
#define IOCAN5                        910
#define IOCAF                         911
#define IOCAF0                        912
#define IOCAF1                        913
#define IOCAF2                        914
#define IOCAF3                        915
#define IOCAF4                        916
#define IOCAF5                        917
#define IOCBP                         918
#define IOCBP4                        919
#define IOCBP5                        920
#define IOCBP6                        921
#define IOCBP7                        922
#define IOCBN                         923
#define IOCBN4                        924
#define IOCBN5                        925
#define IOCBN6                        926
#define IOCBN7                        927
#define IOCBF                         928
#define IOCBF4                        929
#define IOCBF5                        930
#define IOCBF6                        931
#define IOCBF7                        932
#define IOCCP                         933
#define IOCCP0                        934
#define IOCCP1                        935
#define IOCCP2                        936
#define IOCCP3                        937
#define IOCCP4                        938
#define IOCCP5                        939
#define IOCCP6                        940
#define IOCCP7                        941
#define IOCCN                         942
#define IOCCN0                        943
#define IOCCN1                        944
#define IOCCN2                        945
#define IOCCN3                        946
#define IOCCN4                        947
#define IOCCN5                        948
#define IOCCN6                        949
#define IOCCN7                        950
#define IOCCF                         951
#define IOCCF0                        952
#define IOCCF1                        953
#define IOCCF2                        954
#define IOCCF3                        955
#define IOCCF4                        956
#define IOCCF5                        957
#define IOCCF6                        958
#define IOCCF7                        959
#define MD1CON0                       960
#define MD1BIT                        961
#define MD1CON0_BIT                   962
#define MD1CON0_OPOL                  963
#define MD1OPOL                       964
#define MD1CON0_OUT                   965
#define MD1OUT                        966
#define MD1CON0_EN                    967
#define MD1EN                         968
#define MD1CON1                       969
#define MD1CLSYNC                     970
#define MD1CON1_CLSYNC                971
#define MD1CON1_CLPOL                 972
#define MD1CLPOL                      973
#define MD1CON1_CHSYNC                974
#define MD1CHSYNC                     975
#define MD1CHPOL                      976
#define MD1CON1_CHPOL                 977
#define MD1SRC                        978
#define MD1MS0                        979
#define MD1SRC_MS0                    980
#define MD1MS                         981
#define MD1SRC_MS                     982
#define MD1MS1                        983
#define MD1SRC_MS1                    984
#define MD1MS2                        985
#define MD1SRC_MS2                    986
#define MD1MS3                        987
#define MD1SRC_MS3                    988
#define MD1MS4                        989
#define MD1SRC_MS4                    990
#define MD1CARL                       991
#define MD1CL                         992
#define MD1CARL_CL0                   993
#define MD1CL0                        994
#define MD1CARL_CL                    995
#define MD1CARL_CL1                   996
#define MD1CL1                        997
#define MD1CARL_CL2                   998
#define MD1CL2                        999
#define MD1CARL_CL3                   1000
#define MD1CL3                        1001
#define MD1CARH                       1002
#define MD1CARH_CH                    1003
#define MD1CH                         1004
#define MD1CH0                        1005
#define MD1CARH_CH0                   1006
#define MD1CH1                        1007
#define MD1CARH_CH1                   1008
#define MD1CH2                        1009
#define MD1CARH_CH2                   1010
#define MD1CH3                        1011
#define MD1CARH_CH3                   1012
#define HIDRVC                        1013
#define HIDC4                         1014
#define HIDC5                         1015
#define T4TMR                         1016
#define TMR4                          1017
#define T4TMR_TMR                     1018
#define T4PR_PR                       1019
#define T4PR                          1020
#define T4CON                         1021
#define T4CON_OUTPS                   1022
#define T4OUTPS0                      1023
#define T4OUTPS                       1024
#define T4CON_OUTPS0                  1025
#define T4OUTPS1                      1026
#define T4CON_OUTPS1                  1027
#define T4CON_OUTPS2                  1028
#define T4OUTPS2                      1029
#define T4OUTPS3                      1030
#define T4CON_OUTPS3                  1031
#define T4CKPS0                       1032
#define T4CON_CKPS0                   1033
#define T4CKPS                        1034
#define T4CON_CKPS                    1035
#define T4CKPS1                       1036
#define T4CON_CKPS1                   1037
#define T4CKPS2                       1038
#define T4CON_CKPS2                   1039
#define T4CON_ON                      1040
#define T4ON                          1041
#define TMR4ON                        1042
#define T4HLT                         1043
#define T4MODE                        1044
#define T4HLT_MODE                    1045
#define T4HLT_MODE0                   1046
#define T4MODE0                       1047
#define T4HLT_MODE1                   1048
#define T4MODE1                       1049
#define T4HLT_MODE2                   1050
#define T4MODE2                       1051
#define T4HLT_MODE3                   1052
#define T4MODE3                       1053
#define T4HLT_MODE4                   1054
#define T4MODE4                       1055
#define T4CKSYNC                      1056
#define T4HLT_CKSYNC                  1057
#define T4HLT_CKPOL                   1058
#define T4CKPOL                       1059
#define T4PSYNC                       1060
#define T4HLT_PSYNC                   1061
#define T4CLKCON                      1062
#define T4CS                          1063
#define T4CLKCON_CS                   1064
#define T4CS0                         1065
#define T4CLKCON_CS0                  1066
#define T4CS1                         1067
#define T4CLKCON_CS1                  1068
#define T4CS2                         1069
#define T4CLKCON_CS2                  1070
#define T4CS3                         1071
#define T4CLKCON_CS3                  1072
#define T4RST                         1073
#define T4RSEL0                       1074
#define T4RSEL                        1075
#define T4RST_RSEL                    1076
#define T4RST_RSEL0                   1077
#define T4RSEL1                       1078
#define T4RST_RSEL1                   1079
#define T4RSEL2                       1080
#define T4RST_RSEL2                   1081
#define T4RSEL3                       1082
#define T4RST_RSEL3                   1083
#define T6TMR                         1084
#define TMR6                          1085
#define T6TMR_TMR                     1086
#define T6PR_PR                       1087
#define T6PR                          1088
#define T6CON                         1089
#define T6CON_OUTPS0                  1090
