tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1769_tdd.h
#define T6OUTPS                       1091
#define T6CON_OUTPS                   1092
#define T6OUTPS0                      1093
#define T6CON_OUTPS1                  1094
#define T6OUTPS1                      1095
#define T6CON_OUTPS2                  1096
#define T6OUTPS2                      1097
#define T6CON_OUTPS3                  1098
#define T6OUTPS3                      1099
#define T6CON_CKPS0                   1100
#define T6CKPS                        1101
#define T6CKPS0                       1102
#define T6CON_CKPS                    1103
#define T6CON_CKPS1                   1104
#define T6CKPS1                       1105
#define T6CON_CKPS2                   1106
#define T6CKPS2                       1107
#define TMR6ON                        1108
#define T6ON                          1109
#define T6CON_ON                      1110
#define T6HLT                         1111
#define T6MODE0                       1112
#define T6HLT_MODE0                   1113
#define T6HLT_MODE                    1114
#define T6MODE                        1115
#define T6HLT_MODE1                   1116
#define T6MODE1                       1117
#define T6HLT_MODE2                   1118
#define T6MODE2                       1119
#define T6HLT_MODE3                   1120
#define T6MODE3                       1121
#define T6MODE4                       1122
#define T6HLT_MODE4                   1123
#define T6CKSYNC                      1124
#define T6HLT_CKSYNC                  1125
#define T6CKPOL                       1126
#define T6HLT_CKPOL                   1127
#define T6PSYNC                       1128
#define T6HLT_PSYNC                   1129
#define T6CLKCON                      1130
#define T6CS                          1131
#define T6CLKCON_CS                   1132
#define T6CLKCON_CS0                  1133
#define T6CS0                         1134
#define T6CLKCON_CS1                  1135
#define T6CS1                         1136
#define T6CLKCON_CS2                  1137
#define T6CS2                         1138
#define T6CLKCON_CS3                  1139
#define T6CS3                         1140
#define T6RST                         1141
#define T6RST_RSEL                    1142
#define T6RST_RSEL0                   1143
#define T6RSEL                        1144
#define T6RSEL0                       1145
#define T6RST_RSEL1                   1146
#define T6RSEL1                       1147
#define T6RSEL2                       1148
#define T6RST_RSEL2                   1149
#define T6RST_RSEL3                   1150
#define T6RSEL3                       1151
#define TMR3L                         1152
#define TMR3L_TMR                     1153
#define TMR3H                         1154
#define TMR3H_TMR                     1155
#define T3CON                         1156
#define T3CON_TMRON                   1157
#define TMR3ON                        1158
#define T3CON_ON                      1159
#define T3ON                          1160
#define nT3SYNC                       1161
#define T3CON_nSYNC                   1162
#define T3CON_SYNC                    1163
#define T3CON_CKPS0                   1164
#define T3CKPS0                       1165
#define T3CON_CKPS                    1166
#define T3CON_CKPS1                   1167
#define T3CKPS1                       1168
#define TMR3CS0                       1169
#define T3CON_CS0                     1170
#define T3CS0                         1171
#define T3CON_CS                      1172
#define TMR3CS1                       1173
#define T3CON_CS1                     1174
#define T3CS1                         1175
#define T3GCON                        1176
#define T3GCON_GSS0                   1177
#define T3GSS0                        1178
#define T3GCON_GSS                    1179
#define T3GCON_GSS1                   1180
#define T3GSS1                        1181
#define T3GCON_GVAL                   1182
#define T3GVAL                        1183
#define T3GCON_GGO_nDONE              1184
#define T3GGO_nDONE                   1185
#define T3GSPM                        1186
#define T3GCON_GSPM                   1187
#define T3GCON_GTM                    1188
#define T3GTM                         1189
#define T3GPOL                        1190
#define T3GCON_GPOL                   1191
#define TMR3GE                        1192
#define T3GCON_GE                     1193
#define T3GE                          1194
#define TMR5L                         1195
#define TMR5L_TMR                     1196
#define TMR5H                         1197
#define TMR5H_TMR                     1198
#define T5CON                         1199
#define TMR5ON                        1200
#define T5CON_ON                      1201
#define T5ON                          1202
#define T5CON_TMRON                   1203
#define T5CON_SYNC                    1204
#define T5CON_nSYNC                   1205
#define nT5SYNC                       1206
#define T5CON_CKPS                    1207
#define T5CON_CKPS0                   1208
#define T5CKPS0                       1209
#define T5CON_CKPS1                   1210
#define T5CKPS1                       1211
#define T5CON_CS                      1212
#define T5CON_CS0                     1213
#define T5CS0                         1214
#define TMR5CS0                       1215
#define T5CON_CS1                     1216
#define T5CS1                         1217
#define TMR5CS1                       1218
#define T5GCON                        1219
#define T5GSS0                        1220
#define T5GCON_GSS0                   1221
#define T5GCON_GSS                    1222
#define T5GSS1                        1223
#define T5GCON_GSS1                   1224
#define T5GVAL                        1225
#define T5GCON_GVAL                   1226
#define T5GCON_GGO_nDONE              1227
#define T5GGO_nDONE                   1228
#define T5GSPM                        1229
#define T5GCON_GSPM                   1230
#define T5GTM                         1231
#define T5GCON_GTM                    1232
#define T5GPOL                        1233
#define T5GCON_GPOL                   1234
#define T5GE                          1235
#define TMR5GE                        1236
#define T5GCON_GE                     1237
#define OPA1NCHS                      1238
#define OPA1NCH                       1239
#define OPA1NCHS_NCH                  1240
#define OPA1PCHS                      1241
#define OPA1PCHS_PCH                  1242
#define OPA1PCH                       1243
#define OPA1CON                       1244
#define OPA1CON_ORM                   1245
#define OPA1ORM0                      1246
#define OPA1CON_ORM0                  1247
#define OPA1ORM                       1248
#define OPA1ORM1                      1249
#define OPA1CON_ORM1                  1250
#define OPA1CON_ORPOL                 1251
#define OPA1ORPOL                     1252
#define OPA1CON_UG                    1253
#define OPA1UG                        1254
#define OPA1CON_EN                    1255
#define OPA1EN                        1256
#define OPA1ORS                       1257
#define OPA1ORS_ORS                   1258
#define OPA2NCHS                      1259
#define OPA2NCHS_NCH                  1260
#define OPA2NCH                       1261
#define OPA2PCHS                      1262
#define OPA2PCHS_PCH                  1263
#define OPA2PCH                       1264
#define OPA2CON                       1265
#define OPA2CON_ORM0                  1266
#define OPA2ORM                       1267
#define OPA2ORM0                      1268
#define OPA2CON_ORM                   1269
#define OPA2CON_ORM1                  1270
#define OPA2ORM1                      1271
#define OPA2CON_ORPOL                 1272
#define OPA2ORPOL                     1273
#define OPA2CON_UG                    1274
#define OPA2UG                        1275
#define OPA2CON_EN                    1276
#define OPA2EN                        1277
#define OPA2ORS                       1278
#define OPA2ORS_ORS                   1279
#define DACLD                         1280
#define DAC1LD                        1281
#define DAC2LD                        1282
#define DAC1CON0                      1283
#define DAC1CON0_DACNSS0              1284
#define DAC1CON0_DACNSS               1285
#define DAC1CON0_NSS0                 1286
#define DAC1NSS                       1287
#define DAC1CON0_NSS                  1288
#define DAC1NSS0                      1289
#define DAC1CON0_DACPSS0              1290
#define DAC1CON0_PSS0                 1291
#define DAC1CON0_PSS                  1292
#define DAC1CON0_DACPSS               1293
#define DAC1PSS                       1294
#define DAC1PSS0                      1295
#define DAC1CON0_DACPSS1              1296
#define DAC1PSS1                      1297
#define DAC1CON0_PSS1                 1298
#define DAC1CON0_OE1                  1299
#define DAC1CON0_DACOE                1300
#define DAC1CON0_OE                   1301
#define DAC1OE1                       1302
#define DAC1CON0_DACOE1               1303
#define DAC1FM                        1304
#define DAC1CON0_FM                   1305
#define DAC1CON0_DACFM                1306
#define DAC1CON0_EN                   1307
#define DAC1CON0_DACEN                1308
#define DAC1EN                        1309
#define DAC1REFL                      1310
#define DAC1REF0                      1311
#define DAC1REFL_R0                   1312
#define DAC1REFL_REF0                 1313
#define DAC1R0                        1314
#define DAC1REF1                      1315
#define DAC1REFL_REF1                 1316
#define DAC1REFL_R1                   1317
#define DAC1R1                        1318
#define DAC1REF2                      1319
#define DAC1REFL_R2                   1320
#define DAC1REFL_REF2                 1321
#define DAC1R2                        1322
#define DAC1REF3                      1323
#define DAC1REFL_R3                   1324
#define DAC1REFL_REF3                 1325
#define DAC1R3                        1326
#define DAC1REF4                      1327
#define DAC1REFL_REF4                 1328
#define DAC1REFL_R4                   1329
#define DAC1R4                        1330
#define DAC1REFL_R5                   1331
#define DAC1REF5                      1332
#define DAC1REFL_REF5                 1333
#define DAC1R5                        1334
#define DAC1REF6                      1335
#define DAC1REFL_REF6                 1336
#define DAC1REFL_R6                   1337
#define DAC1R6                        1338
#define DAC1REF7                      1339
#define DAC1REFL_REF7                 1340
#define DAC1REFL_R7                   1341
#define DAC1R7                        1342
#define DAC1REFH                      1343
#define DAC1REFH_R8                   1344
#define DAC1REF8                      1345
#define DAC1REFH_REF8                 1346
#define DAC1R8                        1347
#define DAC1REF9                      1348
#define DAC1REFH_R9                   1349
#define DAC1REFH_REF9                 1350
#define DAC1R9                        1351
#define DAC1REFH_REF10                1352
#define DAC1R10                       1353
#define DAC1REF10                     1354
#define DAC1REFH_R10                  1355
#define DAC1REFH_REF11                1356
#define DAC1R11                       1357
#define DAC1REF11                     1358
#define DAC1REFH_R11                  1359
#define DAC1REFH_REF12                1360
#define DAC1REF12                     1361
#define DAC1R12                       1362
#define DAC1REFH_R12                  1363
#define DAC1REFH_REF13                1364
#define DAC1R13                       1365
#define DAC1REF13                     1366
#define DAC1REFH_R13                  1367
#define DAC1REFH_REF14                1368
#define DAC1R14                       1369
#define DAC1REF14                     1370
#define DAC1REFH_R14                  1371
#define DAC1REFH_REF15                1372
#define DAC1R15                       1373
#define DAC1REF15                     1374
#define DAC1REFH_R15                  1375
#define DAC2CON0                      1376
#define DAC2CON0_DACNSS               1377
#define DAC2CON0_NSS0                 1378
#define DAC2NSS                       1379
#define DAC2NSS0                      1380
#define DAC2CON0_NSS                  1381
#define DAC2CON0_DACNSS0              1382
#define DAC2CON0_DACPSS0              1383
#define DAC2PSS0                      1384
#define DAC2PSS                       1385
#define DAC2CON0_DACPSS               1386
#define DAC2CON0_PSS0                 1387
#define DAC2CON0_PSS                  1388
#define DAC2CON0_DACPSS1              1389
#define DAC2PSS1                      1390
#define DAC2CON0_PSS1                 1391
#define DAC2CON0_DACOE1               1392
#define DAC2CON0_OE1                  1393
#define DAC2CON0_DACOE                1394
#define DAC2OE1                       1395
#define DAC2CON0_OE                   1396
#define DAC2FM                        1397
#define DAC2CON0_DACFM                1398
#define DAC2CON0_FM                   1399
#define DAC2EN                        1400
#define DAC2CON0_DACEN                1401
#define DAC2CON0_EN                   1402
#define DAC2REFL                      1403
#define DAC2REF0                      1404
#define DAC2REFL_REF0                 1405
#define DAC2REFL_R0                   1406
#define DAC2R0                        1407
#define DAC2REF1                      1408
#define DAC2REFL_REF1                 1409
#define DAC2REFL_R1                   1410
#define DAC2R1                        1411
#define DAC2REF2                      1412
#define DAC2REFL_REF2                 1413
#define DAC2REFL_R2                   1414
#define DAC2R2                        1415
#define DAC2REF3                      1416
#define DAC2REFL_REF3                 1417
#define DAC2REFL_R3                   1418
#define DAC2R3                        1419
#define DAC2REF4                      1420
#define DAC2REFL_REF4                 1421
#define DAC2REFL_R4                   1422
#define DAC2R4                        1423
#define DAC2REF5                      1424
#define DAC2REFL_REF5                 1425
#define DAC2REFL_R5                   1426
#define DAC2R5                        1427
#define DAC2REF6                      1428
#define DAC2REFL_REF6                 1429
#define DAC2REFL_R6                   1430
#define DAC2R6                        1431
#define DAC2REF7                      1432
#define DAC2REFL_REF7                 1433
#define DAC2REFL_R7                   1434
#define DAC2R7                        1435
#define DAC2REFH                      1436
#define DAC2REF8                      1437
#define DAC2REFH_REF8                 1438
#define DAC2R8                        1439
#define DAC2REFH_R8                   1440
#define DAC2REF9                      1441
#define DAC2REFH_REF9                 1442
#define DAC2R9                        1443
#define DAC2REFH_R9                   1444
#define DAC2REFH_REF10                1445
#define DAC2REFH_R10                  1446
#define DAC2REF10                     1447
#define DAC2R10                       1448
#define DAC2REFH_R11                  1449
#define DAC2REFH_REF11                1450
#define DAC2REF11                     1451
#define DAC2R11                       1452
#define DAC2REFH_REF12                1453
#define DAC2REFH_R12                  1454
#define DAC2REF12                     1455
#define DAC2R12                       1456
#define DAC2REFH_R13                  1457
#define DAC2REF13                     1458
#define DAC2REFH_REF13                1459
#define DAC2R13                       1460
#define DAC2REFH_REF14                1461
#define DAC2REFH_R14                  1462
#define DAC2REF14                     1463
#define DAC2R14                       1464
#define DAC2REFH_REF15                1465
#define DAC2REFH_R15                  1466
#define DAC2R15                       1467
#define DAC2REF15                     1468
#define DAC3CON0                      1469
#define DAC3CON0_DACNSS               1470
#define DAC3NSS                       1471
#define DAC3CON0_NSS                  1472
#define DAC3CON0_PSS                  1473
#define DAC3PSS0                      1474
#define DAC3CON0_DACPSS               1475
#define DAC3PSS                       1476
#define DAC3CON0_PSS0                 1477
#define DAC3CON0_DACPSS0              1478
#define DAC3PSS1                      1479
#define DAC3CON0_PSS1                 1480
#define DAC3CON0_DACPSS1              1481
#define DAC3OE1                       1482
#define DAC3CON0_DACOE1               1483
#define DAC3CON0_OE1                  1484
#define DAC3EN                        1485
#define DAC3CON0_EN                   1486
#define DAC3CON0_DACEN                1487
#define DAC3REF                       1488
#define DAC3REF0                      1489
#define DAC3R                         1490
#define DAC3REF_R0                    1491
#define DAC3REF_REF0                  1492
#define DAC3REF_DACR                  1493
#define DAC3R0                        1494
#define DAC3REF_DACR0                 1495
#define DAC3REF1                      1496
#define DAC3REF_R1                    1497
#define DAC3REF_REF1                  1498
#define DAC3R1                        1499
#define DAC3REF_DACR1                 1500
#define DAC3REF2                      1501
#define DAC3REF_R2                    1502
#define DAC3REF_REF2                  1503
#define DAC3R2                        1504
#define DAC3REF_DACR2                 1505
#define DAC3REF3                      1506
#define DAC3REF_REF3                  1507
#define DAC3REF_R3                    1508
#define DAC3R3                        1509
#define DAC3REF_DACR3                 1510
#define DAC3REF4                      1511
#define DAC3REF_R4                    1512
#define DAC3REF_REF4                  1513
#define DAC3R4                        1514
#define DAC3REF_DACR4                 1515
#define DAC3REF5                      1516
#define DAC3REF_REF5                  1517
#define DAC4CON0                      1518
#define DAC4NSS                       1519
#define DAC4CON0_NSS                  1520
#define DAC4CON0_DACNSS               1521
#define DAC4PSS                       1522
#define DAC4CON0_DACPSS0              1523
#define DAC4CON0_PSS0                 1524
#define DAC4CON0_DACPSS               1525
#define DAC4PSS0                      1526
#define DAC4CON0_PSS                  1527
#define DAC4CON0_DACPSS1              1528
#define DAC4PSS1                      1529
#define DAC4CON0_PSS1                 1530
#define DAC4CON0_DACOE1               1531
#define DAC4OE1                       1532
#define DAC4CON0_OE1                  1533
#define DAC4CON0_EN                   1534
#define DAC4CON0_DACEN                1535
#define DAC4EN                        1536
#define DAC4REF                       1537
#define DAC4REF_DACR0                 1538
#define DAC4REF_REF0                  1539
#define DAC4REF_DACR                  1540
#define DAC4R0                        1541
#define DAC4REF_R0                    1542
#define DAC4REF0                      1543
#define DAC4R                         1544
#define DAC4REF_DACR1                 1545
#define DAC4REF_REF1                  1546
#define DAC4R1                        1547
#define DAC4REF_R1                    1548
#define DAC4REF1                      1549
#define DAC4REF_DACR2                 1550
#define DAC4REF_REF2                  1551
#define DAC4REF2                      1552
#define DAC4R2                        1553
#define DAC4REF_R2                    1554
#define DAC4REF_DACR3                 1555
#define DAC4REF_REF3                  1556
#define DAC4R3                        1557
#define DAC4REF_R3                    1558
#define DAC4REF3                      1559
#define DAC4REF_DACR4                 1560
#define DAC4REF_R4                    1561
#define DAC4REF_REF4                  1562
#define DAC4R4                        1563
#define DAC4REF4                      1564
#define DAC4REF_REF5                  1565
#define DAC4REF5                      1566
#define PWM3DCL                       1567
#define PWM3DC0                       1568
#define PWM3DCL_PWMPW0                1569
#define PWM3DCL_DC0                   1570
#define PWM3DCL_DC                    1571
#define PWM3DC1                       1572
#define PWM3DCL_PWMPW1                1573
#define PWM3DCL_DC1                   1574
#define PWM3DCH                       1575
#define PWM3DC2                       1576
#define PWM3DCH_DC2                   1577
#define PWM3DCH_DC                    1578
#define PWM3DCH_PWMPW2                1579
#define PWM3DC3                       1580
#define PWM3DCH_DC3                   1581
#define PWM3DCH_PWMPW3                1582
#define PWM3DC4                       1583
#define PWM3DCH_DC4                   1584
#define PWM3DCH_PWMPW4                1585
#define PWM3DC5                       1586
#define PWM3DCH_DC5                   1587
#define PWM3DCH_PWMPW5                1588
#define PWM3DC6                       1589
#define PWM3DCH_DC6                   1590
#define PWM3DCH_PWMPW6                1591
#define PWM3DC7                       1592
#define PWM3DCH_DC7                   1593
#define PWM3DCH_PWMPW7                1594
#define PWM3DC8                       1595
#define PWM3DCH_DC8                   1596
#define PWM3DCH_PWMPW8                1597
#define PWM3DC9                       1598
#define PWM3DCH_DC9                   1599
#define PWM3DCH_PWMPW9                1600
#define PWM3CON                       1601
#define PWM3CON_POL                   1602
#define PWM3POL                       1603
#define PWM3CON_OUT                   1604
#define PWM3OUT                       1605
#define PWM3EN                        1606
#define PWM3CON_EN                    1607
#define PWM4DCL                       1608
#define PWM4DCL_PWMPW0                1609
#define PWM4DCL_DC                    1610
#define PWM4DC0                       1611
#define PWM4DCL_DC0                   1612
#define PWM4DCL_PWMPW1                1613
#define PWM4DC1                       1614
#define PWM4DCL_DC1                   1615
#define PWM4DCH                       1616
#define PWM4DCH_PWMPW2                1617
#define PWM4DCH_DC                    1618
#define PWM4DC2                       1619
#define PWM4DCH_DC2                   1620
#define PWM4DCH_PWMPW3                1621
#define PWM4DC3                       1622
#define PWM4DCH_DC3                   1623
#define PWM4DCH_PWMPW4                1624
#define PWM4DC4                       1625
#define PWM4DCH_DC4                   1626
#define PWM4DCH_PWMPW5                1627
#define PWM4DC5                       1628
#define PWM4DCH_DC5                   1629
#define PWM4DCH_PWMPW6                1630
#define PWM4DC6                       1631
#define PWM4DCH_DC6                   1632
#define PWM4DCH_PWMPW7                1633
#define PWM4DC7                       1634
#define PWM4DCH_DC7                   1635
#define PWM4DCH_PWMPW8                1636
#define PWM4DC8                       1637
#define PWM4DCH_DC8                   1638
#define PWM4DCH_PWMPW9                1639
#define PWM4DC9                       1640
#define PWM4DCH_DC9                   1641
#define PWM4CON                       1642
#define PWM4POL                       1643
#define PWM4CON_POL                   1644
#define PWM4CON_OUT                   1645
#define PWM4OUT                       1646
#define PWM4EN                        1647
#define PWM4CON_EN                    1648
