tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1769_tdd.h
#define COG1PHR                       1649
#define G1PHR0                        1650
#define COG1PHR_PHR                   1651
#define COG1PHR_PHR0                  1652
#define G1PHR1                        1653
#define COG1PHR_PHR1                  1654
#define COG1PHR_PHR2                  1655
#define G1PHR2                        1656
#define COG1PHR_PHR3                  1657
#define G1PHR3                        1658
#define G1PHR4                        1659
#define COG1PHR_PHR4                  1660
#define G1PHR5                        1661
#define COG1PHR_PHR5                  1662
#define COG1PHF                       1663
#define G1PHF0                        1664
#define COG1PHF_PHF0                  1665
#define COG1PHF_PHF                   1666
#define G1PHF1                        1667
#define COG1PHF_PHF1                  1668
#define G1PHF2                        1669
#define COG1PHF_PHF2                  1670
#define G1PHF3                        1671
#define COG1PHF_PHF3                  1672
#define G1PHF4                        1673
#define COG1PHF_PHF4                  1674
#define G1PHF5                        1675
#define COG1PHF_PHF5                  1676
#define COG1BLKR                      1677
#define COG1BLKR_BLKR                 1678
#define COG1BLKR_BLKR0                1679
#define G1BLKR0                       1680
#define COG1BLKR_BLKR1                1681
#define G1BLKR1                       1682
#define COG1BLKR_BLKR2                1683
#define G1BLKR2                       1684
#define COG1BLKR_BLKR3                1685
#define G1BLKR3                       1686
#define COG1BLKR_BLKR4                1687
#define G1BLKR4                       1688
#define G1BLKR5                       1689
#define COG1BLKR_BLKR5                1690
#define COG1BLKF                      1691
#define COG1BLKF_BLKF                 1692
#define G1BLKF0                       1693
#define COG1BLKF_BLKF0                1694
#define G1BLKF1                       1695
#define COG1BLKF_BLKF1                1696
#define COG1BLKF_BLKF2                1697
#define G1BLKF2                       1698
#define G1BLKF3                       1699
#define COG1BLKF_BLKF3                1700
#define COG1BLKF_BLKF4                1701
#define G1BLKF4                       1702
#define G1BLKF5                       1703
#define COG1BLKF_BLKF5                1704
#define COG1DBR                       1705
#define G1DBR0                        1706
#define COG1DBR_DBR                   1707
#define COG1DBR_DBR0                  1708
#define G1DBR1                        1709
#define COG1DBR_DBR1                  1710
#define G1DBR2                        1711
#define COG1DBR_DBR2                  1712
#define G1DBR3                        1713
#define COG1DBR_DBR3                  1714
#define G1DBR4                        1715
#define COG1DBR_DBR4                  1716
#define G1DBR5                        1717
#define COG1DBR_DBR5                  1718
#define COG1DBF                       1719
#define COG1DBF_DBF0                  1720
#define G1DBF0                        1721
#define G1DBF                         1722
#define G1DBF1                        1723
#define COG1DBF_DBF1                  1724
#define G1DBF2                        1725
#define COG1DBF_DBF2                  1726
#define G1DBF3                        1727
#define COG1DBF_DBF3                  1728
#define G1DBF4                        1729
#define COG1DBF_DBF4                  1730
#define G1DBF5                        1731
#define COG1DBF_DBF5                  1732
#define COG1CON0                      1733
#define COG1CON0_MD                   1734
#define G1MD0                         1735
#define COG1CON0_MD0                  1736
#define G1MD                          1737
#define G1MD1                         1738
#define COG1CON0_MD1                  1739
#define G1MD2                         1740
#define COG1CON0_MD2                  1741
#define COG1CON0_CS0                  1742
#define G1CS                          1743
#define G1CS0                         1744
#define COG1CON0_CS                   1745
#define COG1CON0_CS1                  1746
#define G1CS1                         1747
#define G1LD                          1748
#define COG1CON0_LD                   1749
#define COG1CON0_EN                   1750
#define G1EN                          1751
#define COG1CON1                      1752
#define COG1CON1_POLA                 1753
#define G1POLA                        1754
#define COG1CON1_POLB                 1755
#define G1POLB                        1756
#define COG1CON1_POLC                 1757
#define G1POLC                        1758
#define COG1CON1_POLD                 1759
#define G1POLD                        1760
#define COG1CON1_FDBS                 1761
#define G1FDBS                        1762
#define COG1CON1_RDBS                 1763
#define G1RDBS                        1764
#define COG1RIS0                      1765
#define COG1RIS0_RIS0                 1766
#define G1RIS0                        1767
#define COG1RIS0_RIS1                 1768
#define G1RIS1                        1769
#define COG1RIS0_RIS2                 1770
#define G1RIS2                        1771
#define COG1RIS0_RIS3                 1772
#define G1RIS3                        1773
#define COG1RIS0_RIS4                 1774
#define G1RIS4                        1775
#define COG1RIS0_RIS5                 1776
#define G1RIS5                        1777
#define COG1RIS0_RIS6                 1778
#define G1RIS6                        1779
#define COG1RIS0_RIS7                 1780
#define G1RIS7                        1781
#define COG1RIS1                      1782
#define COG1RIS1_RIS8                 1783
#define G1RIS8                        1784
#define COG1RIS1_RIS9                 1785
#define G1RIS9                        1786
#define G1RIS10                       1787
#define COG1RIS1_RIS10                1788
#define G1RIS11                       1789
#define COG1RIS1_RIS11                1790
#define G1RIS12                       1791
#define COG1RIS1_RIS12                1792
#define G1RIS13                       1793
#define COG1RIS1_RIS13                1794
#define G1RIS14                       1795
#define RIS14                         1796
#define G1RIS15                       1797
#define RIS15                         1798
#define COG1RSIM0                     1799
#define G1RSIM0                       1800
#define COG1RSIM0_RSIM0               1801
#define G1RSIM1                       1802
#define COG1RSIM0_RSIM1               1803
#define G1RSIM2                       1804
#define COG1RSIM0_RSIM2               1805
#define G1RSIM3                       1806
#define COG1RSIM0_RSIM3               1807
#define G1RSIM4                       1808
#define COG1RSIM0_RSIM4               1809
#define G1RSIM5                       1810
#define COG1RSIM0_RSIM5               1811
#define G1RSIM6                       1812
#define COG1RSIM0_RSIM6               1813
#define G1RSIM7                       1814
#define COG1RSIM0_RSIM7               1815
#define COG1RSIM1                     1816
#define COG1RSIM1_RSIM8               1817
#define G1RSIM8                       1818
#define COG1RSIM1_RSIM9               1819
#define G1RSIM9                       1820
#define G1RSIM10                      1821
#define COG1RSIM1_RSIM10              1822
#define G1RSIM11                      1823
#define COG1RSIM1_RSIM11              1824
#define G1RSIM12                      1825
#define COG1RSIM1_RSIM12              1826
#define G1RSIM13                      1827
#define COG1RSIM1_RSIM13              1828
#define RSIM14                        1829
#define G1RSIM14                      1830
#define RSIM15                        1831
#define G1RSIM15                      1832
#define COG1FIS0                      1833
#define G1FIS0                        1834
#define COG1FIS0_FIS0                 1835
#define G1FIS1                        1836
#define COG1FIS0_FIS1                 1837
#define G1FIS2                        1838
#define COG1FIS0_FIS2                 1839
#define G1FIS3                        1840
#define COG1FIS0_FIS3                 1841
#define G1FIS4                        1842
#define COG1FIS0_FIS4                 1843
#define G1FIS5                        1844
#define COG1FIS0_FIS5                 1845
#define G1FIS6                        1846
#define COG1FIS0_FIS6                 1847
#define G1FIS7                        1848
#define COG1FIS0_FIS7                 1849
#define COG1FIS1                      1850
#define COG1FIS1_FIS8                 1851
#define G1FIS8                        1852
#define COG1FIS1_FIS9                 1853
#define G1FIS9                        1854
#define COG1FIS1_FIS10                1855
#define G1FIS10                       1856
#define COG1FIS1_FIS11                1857
#define G1FIS11                       1858
#define COG1FIS1_FIS12                1859
#define G1FIS12                       1860
#define COG1FIS1_FIS13                1861
#define G1FIS13                       1862
#define G1FIS14                       1863
#define FIS14                         1864
#define G1FIS15                       1865
#define FIS15                         1866
#define COG1FSIM0                     1867
#define COG1FSIM0_FSIM0               1868
#define G1FSIM0                       1869
#define COG1FSIM0_FSIM1               1870
#define G1FSIM1                       1871
#define COG1FSIM0_FSIM2               1872
#define G1FSIM2                       1873
#define COG1FSIM0_FSIM3               1874
#define G1FSIM3                       1875
#define COG1FSIM0_FSIM4               1876
#define G1FSIM4                       1877
#define COG1FSIM0_FSIM5               1878
#define G1FSIM5                       1879
#define COG1FSIM0_FSIM6               1880
#define G1FSIM6                       1881
#define COG1FSIM0_FSIM7               1882
#define G1FSIM7                       1883
#define COG1FSIM1                     1884
#define COG1FSIM1_FSIM8               1885
#define G1FSIM8                       1886
#define COG1FSIM1_FSIM9               1887
#define G1FSIM9                       1888
#define COG1FSIM1_FSIM10              1889
#define G1FSIM10                      1890
#define COG1FSIM1_FSIM11              1891
#define G1FSIM11                      1892
#define COG1FSIM1_FSIM12              1893
#define G1FSIM12                      1894
#define COG1FSIM1_FSIM13              1895
#define G1FSIM13                      1896
#define FSIM14                        1897
#define G1FSIM14                      1898
#define FSIM15                        1899
#define G1FSIM15                      1900
#define COG1ASD0                      1901
#define COG1ASD0_ASDAC0               1902
#define G1ASDAC0                      1903
#define COG1ASD0_ASDAC                1904
#define G1ASDAC                       1905
#define COG1ASD0_ASDAC1               1906
#define G1ASDAC1                      1907
#define G1ASDBD0                      1908
#define COG1ASD0_ASDBD0               1909
#define G1ASDBD                       1910
#define COG1ASD0_ASDBD                1911
#define G1ASDBD1                      1912
#define COG1ASD0_ASDBD1               1913
#define G1ASREN                       1914
#define COG1ASD0_ARSEN                1915
#define G1ARSEN                       1916
#define COG1ASD0_ASREN                1917
#define COG1ASD0_ASE                  1918
#define G1ASE                         1919
#define COG1ASD1                      1920
#define COG1ASD1_AS0E                 1921
#define G1AS0E                        1922
#define G1AS1E                        1923
#define COG1ASD1_AS1E                 1924
#define COG1ASD1_AS2E                 1925
#define G1AS2E                        1926
#define COG1ASD1_AS3E                 1927
#define G1AS3E                        1928
#define G1AS4E                        1929
#define COG1ASD1_AS4E                 1930
#define G1AS5E                        1931
#define COG1ASD1_AS5E                 1932
#define G1AS6E                        1933
#define COG1ASD1_AS6E                 1934
#define G1AS7E                        1935
#define COG1ASD1_AS7E                 1936
#define COG1STR                       1937
#define G1STRA                        1938
#define COG1STR_STRA                  1939
#define G1STRB                        1940
#define COG1STR_STRB                  1941
#define G1STRC                        1942
#define COG1STR_STRC                  1943
#define G1STRD                        1944
#define COG1STR_STRD                  1945
#define COG1STR_SDATA                 1946
#define G1SDATA                       1947
#define COG1STR_SDATB                 1948
#define G1SDATB                       1949
#define COG1STR_SDATC                 1950
#define G1SDATC                       1951
#define COG1STR_SDATD                 1952
#define G1SDATD                       1953
#define COG2PHR                       1954
#define G2PHR0                        1955
#define COG2PHR_PHR                   1956
#define COG2PHR_PHR0                  1957
#define G2PHR1                        1958
#define COG2PHR_PHR1                  1959
#define G2PHR2                        1960
#define COG2PHR_PHR2                  1961
#define G2PHR3                        1962
#define COG2PHR_PHR3                  1963
#define G2PHR4                        1964
#define COG2PHR_PHR4                  1965
#define G2PHR5                        1966
#define COG2PHR_PHR5                  1967
#define COG2PHF                       1968
#define COG2PHF_PHF                   1969
#define COG2PHF_PHF0                  1970
#define G2PHF0                        1971
#define COG2PHF_PHF1                  1972
#define G2PHF1                        1973
#define COG2PHF_PHF2                  1974
#define G2PHF2                        1975
#define G2PHF3                        1976
#define COG2PHF_PHF3                  1977
#define COG2PHF_PHF4                  1978
#define G2PHF4                        1979
#define COG2PHF_PHF5                  1980
#define G2PHF5                        1981
#define COG2BLKR                      1982
#define G2BLKR0                       1983
#define COG2BLKR_BLKR                 1984
#define COG2BLKR_BLKR0                1985
#define G2BLKR1                       1986
#define COG2BLKR_BLKR1                1987
#define G2BLKR2                       1988
#define COG2BLKR_BLKR2                1989
#define G2BLKR3                       1990
#define COG2BLKR_BLKR3                1991
#define G2BLKR4                       1992
#define COG2BLKR_BLKR4                1993
#define G2BLKR5                       1994
#define COG2BLKR_BLKR5                1995
#define COG2BLKF                      1996
#define COG2BLKF_BLKF                 1997
#define G2BLKF0                       1998
#define COG2BLKF_BLKF0                1999
#define COG2BLKF_BLKF1                2000
#define G2BLKF1                       2001
#define COG2BLKF_BLKF2                2002
#define G2BLKF2                       2003
#define COG2BLKF_BLKF3                2004
#define G2BLKF3                       2005
#define COG2BLKF_BLKF4                2006
#define G2BLKF4                       2007
#define COG2BLKF_BLKF5                2008
#define G2BLKF5                       2009
#define COG2DBR                       2010
#define COG2DBR_DBR0                  2011
#define G2DBR0                        2012
#define COG2DBR_DBR                   2013
#define COG2DBR_DBR1                  2014
#define G2DBR1                        2015
#define COG2DBR_DBR2                  2016
#define G2DBR2                        2017
#define COG2DBR_DBR3                  2018
#define G2DBR3                        2019
#define COG2DBR_DBR4                  2020
#define G2DBR4                        2021
#define COG2DBR_DBR5                  2022
#define G2DBR5                        2023
#define COG2DBF                       2024
#define G2DBF                         2025
#define G2DBF0                        2026
#define COG2DBF_DBF0                  2027
#define G2DBF1                        2028
#define COG2DBF_DBF1                  2029
#define G2DBF2                        2030
#define COG2DBF_DBF2                  2031
#define G2DBF3                        2032
#define COG2DBF_DBF3                  2033
#define G2DBF4                        2034
#define COG2DBF_DBF4                  2035
#define G2DBF5                        2036
#define COG2DBF_DBF5                  2037
#define COG2CON0                      2038
#define COG2CON0_MD0                  2039
#define G2MD                          2040
#define G2MD0                         2041
#define COG2CON0_MD                   2042
#define COG2CON0_MD1                  2043
#define G2MD1                         2044
#define COG2CON0_MD2                  2045
#define G2MD2                         2046
#define G2CS                          2047
#define COG2CON0_CS                   2048
#define COG2CON0_CS0                  2049
#define G2CS0                         2050
#define COG2CON0_CS1                  2051
#define G2CS1                         2052
#define COG2CON0_LD                   2053
#define G2LD                          2054
#define G2EN                          2055
#define COG2CON0_EN                   2056
#define COG2CON1                      2057
#define G2POLA                        2058
#define COG2CON1_POLA                 2059
#define G2POLB                        2060
#define COG2CON1_POLB                 2061
#define G2POLC                        2062
#define COG2CON1_POLC                 2063
#define G2POLD                        2064
#define COG2CON1_POLD                 2065
#define COG2CON1_FDBS                 2066
#define G2FDBS                        2067
#define G2RDBS                        2068
#define COG2CON1_RDBS                 2069
#define COG2RIS0                      2070
#define G2RIS0                        2071
#define COG2RIS0_RIS0                 2072
#define G2RIS1                        2073
#define COG2RIS0_RIS1                 2074
#define G2RIS2                        2075
#define COG2RIS0_RIS2                 2076
#define G2RIS3                        2077
#define COG2RIS0_RIS3                 2078
#define G2RIS4                        2079
#define COG2RIS0_RIS4                 2080
#define G2RIS5                        2081
#define COG2RIS0_RIS5                 2082
#define G2RIS6                        2083
#define COG2RIS0_RIS6                 2084
#define G2RIS7                        2085
#define COG2RIS0_RIS7                 2086
#define COG2RIS1                      2087
#define G2RIS8                        2088
#define COG2RIS1_RIS8                 2089
#define COG2RIS1_RIS9                 2090
#define G2RIS9                        2091
#define COG2RIS1_RIS10                2092
#define G2RIS10                       2093
#define COG2RIS1_RIS11                2094
#define G2RIS11                       2095
#define COG2RIS1_RIS12                2096
#define G2RIS12                       2097
#define COG2RIS1_RIS13                2098
#define G2RIS13                       2099
#define COG2RSIM0                     2100
#define G2RSIM0                       2101
#define COG2RSIM0_RSIM0               2102
#define G2RSIM1                       2103
#define COG2RSIM0_RSIM1               2104
#define G2RSIM2                       2105
#define COG2RSIM0_RSIM2               2106
#define G2RSIM3                       2107
#define COG2RSIM0_RSIM3               2108
#define G2RSIM4                       2109
#define COG2RSIM0_RSIM4               2110
#define G2RSIM5                       2111
#define COG2RSIM0_RSIM5               2112
#define G2RSIM6                       2113
#define COG2RSIM0_RSIM6               2114
#define G2RSIM7                       2115
#define COG2RSIM0_RSIM7               2116
#define COG2RSIM1                     2117
#define COG2RSIM1_RSIM8               2118
#define G2RSIM8                       2119
#define COG2RSIM1_RSIM9               2120
#define G2RSIM9                       2121
#define COG2RSIM1_RSIM10              2122
#define G2RSIM10                      2123
#define COG2RSIM1_RSIM11              2124
#define G2RSIM11                      2125
#define G2RSIM12                      2126
#define COG2RSIM1_RSIM12              2127
#define G2RSIM13                      2128
#define COG2RSIM1_RSIM13              2129
#define COG2FIS0                      2130
#define G2FIS0                        2131
#define COG2FIS0_FIS0                 2132
#define G2FIS1                        2133
#define COG2FIS0_FIS1                 2134
#define G2FIS2                        2135
#define COG2FIS0_FIS2                 2136
#define G2FIS3                        2137
#define COG2FIS0_FIS3                 2138
#define G2FIS4                        2139
#define COG2FIS0_FIS4                 2140
#define G2FIS5                        2141
#define COG2FIS0_FIS5                 2142
#define G2FIS6                        2143
#define COG2FIS0_FIS6                 2144
#define G2FIS7                        2145
#define COG2FIS0_FIS7                 2146
#define COG2FIS1                      2147
#define COG2FIS1_FIS8                 2148
#define G2FIS8                        2149
#define COG2FIS1_FIS9                 2150
#define G2FIS9                        2151
#define COG2FIS1_FIS10                2152
#define G2FIS10                       2153
#define COG2FIS1_FIS11                2154
#define G2FIS11                       2155
#define COG2FIS1_FIS12                2156
#define G2FIS12                       2157
#define COG2FIS1_FIS13                2158
#define G2FIS13                       2159
#define COG2FSIM0                     2160
#define COG2FSIM0_FSIM0               2161
#define G2FSIM0                       2162
#define COG2FSIM0_FSIM1               2163
#define G2FSIM1                       2164
#define COG2FSIM0_FSIM2               2165
#define G2FSIM2                       2166
#define COG2FSIM0_FSIM3               2167
#define G2FSIM3                       2168
#define G2FSIM4                       2169
#define COG2FSIM0_FSIM4               2170
#define G2FSIM5                       2171
#define COG2FSIM0_FSIM5               2172
#define COG2FSIM0_FSIM6               2173
#define G2FSIM6                       2174
#define G2FSIM7                       2175
#define COG2FSIM0_FSIM7               2176
#define COG2FSIM1                     2177
#define G2FSIM8                       2178
#define COG2FSIM1_FSIM8               2179
#define G2FSIM9                       2180
#define COG2FSIM1_FSIM9               2181
#define G2FSIM10                      2182
#define COG2FSIM1_FSIM10              2183
#define G2FSIM11                      2184
#define COG2FSIM1_FSIM11              2185
#define G2FSIM12                      2186
#define COG2FSIM1_FSIM12              2187
#define G2FSIM13                      2188
#define COG2FSIM1_FSIM13              2189
#define COG2ASD0                      2190
#define COG2ASD0_ASDAC0               2191
#define G2ASDAC                       2192
#define COG2ASD0_ASDAC                2193
#define G2ASDAC0                      2194
#define COG2ASD0_ASDAC1               2195
#define G2ASDAC1                      2196
#define COG2ASD0_ASDBD                2197
#define G2ASDBD0                      2198
#define COG2ASD0_ASDBD0               2199
#define G2ASDBD                       2200
#define G2ASDBD1                      2201
#define COG2ASD0_ASDBD1               2202
#define G2ARSEN                       2203
#define COG2ASD0_ARSEN                2204
#define COG2ASD0_ASREN                2205
#define G2ASREN                       2206
