tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1769_tdd.h
#define COG2ASD0_ASE                  2207
#define G2ASE                         2208
#define COG2ASD1                      2209
#define COG2ASD1_AS0E                 2210
#define G2AS0E                        2211
#define G2AS1E                        2212
#define COG2ASD1_AS1E                 2213
#define COG2ASD1_AS2E                 2214
#define G2AS2E                        2215
#define G2AS3E                        2216
#define COG2ASD1_AS3E                 2217
#define COG2ASD1_AS4E                 2218
#define G2AS4E                        2219
#define COG2ASD1_AS5E                 2220
#define G2AS5E                        2221
#define G2AS6E                        2222
#define COG2ASD1_AS6E                 2223
#define COG2ASD1_AS7E                 2224
#define G2AS7E                        2225
#define COG2STR                       2226
#define COG2STR_STRA                  2227
#define G2STRA                        2228
#define COG2STR_STRB                  2229
#define G2STRB                        2230
#define COG2STR_STRC                  2231
#define G2STRC                        2232
#define COG2STR_STRD                  2233
#define G2STRD                        2234
#define COG2STR_SDATA                 2235
#define G2SDATA                       2236
#define COG2STR_SDATB                 2237
#define G2SDATB                       2238
#define COG2STR_SDATC                 2239
#define G2SDATC                       2240
#define COG2STR_SDATD                 2241
#define G2SDATD                       2242
#define PRG1RTSS                      2243
#define RG1RTSS0                      2244
#define PRG1RTSS_RTSS                 2245
#define PRG1RTSS_RTSS0                2246
#define RG1RTSS1                      2247
#define PRG1RTSS_RTSS1                2248
#define RG1RTSS2                      2249
#define PRG1RTSS_RTSS2                2250
#define RG1RTSS3                      2251
#define PRG1RTSS_RTSS3                2252
#define PRG1FTSS                      2253
#define RG1FTSS0                      2254
#define PRG1FTSS_FTSS                 2255
#define PRG1FTSS_FTSS0                2256
#define RG1FTSS1                      2257
#define PRG1FTSS_FTSS1                2258
#define RG1FTSS2                      2259
#define PRG1FTSS_FTSS2                2260
#define RG1FTSS3                      2261
#define PRG1FTSS_FTSS3                2262
#define PRG1INS                       2263
#define PRG1INS_INS                   2264
#define PRG1INS_INS0                  2265
#define RG1INS0                       2266
#define PRG1INS_INS1                  2267
#define RG1INS1                       2268
#define PRG1INS_INS2                  2269
#define RG1INS2                       2270
#define PRG1INS_INS3                  2271
#define RG1INS3                       2272
#define PRG1CON0                      2273
#define PRG1CON0_GO                   2274
#define RG1GO                         2275
#define RG1OS                         2276
#define PRG1CON0_OS                   2277
#define RG1MODE0                      2278
#define RG1MODE                       2279
#define PRG1CON0_MODE                 2280
#define PRG1CON0_MODE0                2281
#define RG1MODE1                      2282
#define PRG1CON0_MODE1                2283
#define PRG1CON0_REDG                 2284
#define RG1REDG                       2285
#define RG1FEDG                       2286
#define PRG1CON0_FEDG                 2287
#define PRG1CON0_EN                   2288
#define RG1EN                         2289
#define PRG1CON1                      2290
#define PRG1CON1_RPOL                 2291
#define RG1RPOL                       2292
#define PRG1CON1_FPOL                 2293
#define RG1FPOL                       2294
#define PRG1CON1_RDY                  2295
#define RG1RDY                        2296
#define PRG1CON2                      2297
#define RG1ISET0                      2298
#define PRG1CON2_ISET                 2299
#define RG1ISET                       2300
#define PRG1CON2_ISET0                2301
#define RG1ISET1                      2302
#define PRG1CON2_ISET1                2303
#define RG1ISET2                      2304
#define PRG1CON2_ISET2                2305
#define RG1ISET3                      2306
#define PRG1CON2_ISET3                2307
#define RG1ISET4                      2308
#define PRG1CON2_ISET4                2309
#define PRG2RTSS                      2310
#define PRG2RTSS_RTSS                 2311
#define RG2RTSS0                      2312
#define PRG2RTSS_RTSS0                2313
#define RG2RTSS1                      2314
#define PRG2RTSS_RTSS1                2315
#define RG2RTSS2                      2316
#define PRG2RTSS_RTSS2                2317
#define RG2RTSS3                      2318
#define PRG2RTSS_RTSS3                2319
#define PRG2FTSS                      2320
#define RG2FTSS0                      2321
#define PRG2FTSS_FTSS                 2322
#define PRG2FTSS_FTSS0                2323
#define RG2FTSS1                      2324
#define PRG2FTSS_FTSS1                2325
#define PRG2FTSS_FTSS2                2326
#define RG2FTSS2                      2327
#define RG2FTSS3                      2328
#define PRG2FTSS_FTSS3                2329
#define PRG2INS                       2330
#define PRG2INS_INS                   2331
#define PRG2INS_INS0                  2332
#define RG2INS0                       2333
#define PRG2INS_INS1                  2334
#define RG2INS1                       2335
#define PRG2INS_INS2                  2336
#define RG2INS2                       2337
#define PRG2INS_INS3                  2338
#define RG2INS3                       2339
#define PRG2CON0                      2340
#define PRG2CON0_GO                   2341
#define RG2GO                         2342
#define PRG2CON0_OS                   2343
#define RG2OS                         2344
#define RG2MODE0                      2345
#define PRG2CON0_MODE0                2346
#define RG2MODE                       2347
#define PRG2CON0_MODE                 2348
#define RG2MODE1                      2349
#define PRG2CON0_MODE1                2350
#define PRG2CON0_REDG                 2351
#define RG2REDG                       2352
#define RG2FEDG                       2353
#define PRG2CON0_FEDG                 2354
#define PRG2CON0_EN                   2355
#define RG2EN                         2356
#define PRG2CON1                      2357
#define PRG2CON1_RPOL                 2358
#define RG2RPOL                       2359
#define PRG2CON1_FPOL                 2360
#define RG2FPOL                       2361
#define PRG2CON1_RDY                  2362
#define RG2RDY                        2363
#define PRG2CON2                      2364
#define PRG2CON2_ISET                 2365
#define RG2ISET0                      2366
#define PRG2CON2_ISET0                2367
#define RG2ISET                       2368
#define RG2ISET1                      2369
#define PRG2CON2_ISET1                2370
#define RG2ISET2                      2371
#define PRG2CON2_ISET2                2372
#define RG2ISET3                      2373
#define PRG2CON2_ISET3                2374
#define PRG2CON2_ISET4                2375
#define RG2ISET4                      2376
#define PWMEN                         2377
#define MPWM5EN                       2378
#define MPWM6EN                       2379
#define PWMLD                         2380
#define MPWM5LD                       2381
#define MPWM6LD                       2382
#define PWMOUT                        2383
#define MPWM5OUT                      2384
#define MPWM6OUT                      2385
#define PWM5PHL0                      2386
#define PWM5PHL_PH                    2387
#define PWM5PHL                       2388
#define PWM5PHL1                      2389
#define PWM5PHL2                      2390
#define PWM5PHL3                      2391
#define PWM5PHL4                      2392
#define PWM5PHL5                      2393
#define PWM5PHL6                      2394
#define PWM5PHL7                      2395
#define PWM5PHH0                      2396
#define PWM5PHH_PH                    2397
#define PWM5PHH                       2398
#define PWM5PHH1                      2399
#define PWM5PHH2                      2400
#define PWM5PHH3                      2401
#define PWM5PHH4                      2402
#define PWM5PHH5                      2403
#define PWM5PHH6                      2404
#define PWM5PHH7                      2405
#define PWM5DCL_DC                    2406
#define PWM5DCL                       2407
#define PWM5DCL0                      2408
#define PWM5DCL1                      2409
#define PWM5DCL2                      2410
#define PWM5DCL3                      2411
#define PWM5DCL4                      2412
#define PWM5DCL5                      2413
#define PWM5DCL6                      2414
#define PWM5DCL7                      2415
#define PWM5DCH_DC                    2416
#define PWM5DCH                       2417
#define PWM5DCH0                      2418
#define PWM5DCH1                      2419
#define PWM5DCH2                      2420
#define PWM5DCH3                      2421
#define PWM5DCH4                      2422
#define PWM5DCH5                      2423
#define PWM5DCH6                      2424
#define PWM5DCH7                      2425
#define PWM5PRL0                      2426
#define PWM5PRL_PR                    2427
#define PWM5PRL                       2428
#define PWM5PRL1                      2429
#define PWM5PRL2                      2430
#define PWM5PRL3                      2431
#define PWM5PRL4                      2432
#define PWM5PRL5                      2433
#define PWM5PRL6                      2434
#define PWM5PRL7                      2435
#define PWM5PRH_PR                    2436
#define PWM5PRH0                      2437
#define PWM5PRH                       2438
#define PWM5PRH1                      2439
#define PWM5PRH2                      2440
#define PWM5PRH3                      2441
#define PWM5PRH4                      2442
#define PWM5PRH5                      2443
#define PWM5PRH6                      2444
#define PWM5PRH7                      2445
#define PWM5OFL                       2446
#define PWM5OFL0                      2447
#define PWM5OFL_OF                    2448
#define PWM5OFL1                      2449
#define PWM5OFL2                      2450
#define PWM5OFL3                      2451
#define PWM5OFL4                      2452
#define PWM5OFL5                      2453
#define PWM5OFL6                      2454
#define PWM5OFL7                      2455
#define PWM5OFH_OF                    2456
#define PWM5OFH                       2457
#define PWM5OFH0                      2458
#define PWM5OFH1                      2459
#define PWM5OFH2                      2460
#define PWM5OFH3                      2461
#define PWM5OFH4                      2462
#define PWM5OFH5                      2463
#define PWM5OFH6                      2464
#define PWM5OFH7                      2465
#define PWM5TMRL_TMR                  2466
#define PWM5TMRL                      2467
#define PWM5TMRL0                     2468
#define PWM5TMRL1                     2469
#define PWM5TMRL2                     2470
#define PWM5TMRL3                     2471
#define PWM5TMRL4                     2472
#define PWM5TMRL5                     2473
#define PWM5TMRL6                     2474
#define PWM5TMRL7                     2475
#define PWM5TMRH0                     2476
#define PWM5TMRH                      2477
#define PWM5TMRH_TMR                  2478
#define PWM5TMRH1                     2479
#define PWM5TMRH2                     2480
#define PWM5TMRH3                     2481
#define PWM5TMRH4                     2482
#define PWM5TMRH5                     2483
#define PWM5TMRH6                     2484
#define PWM5TMRH7                     2485
#define PWM5CON                       2486
#define PWM5MODE0                     2487
#define PWM5CON_MODE                  2488
#define PWM5CON_MODE0                 2489
#define PWM5MODE                      2490
#define PWM5MODE1                     2491
#define PWM5CON_MODE1                 2492
#define PWM5POL                       2493
#define PWM5CON_POL                   2494
#define PWM5OUT                       2495
#define PWM5CON_OUT                   2496
#define PWM5EN                        2497
#define PWM5CON_EN                    2498
#define PWM5INTE                      2499
#define PWM5INTE_PRIE                 2500
#define PWM5PRIE                      2501
#define PWM5INTE_DCIE                 2502
#define PWM5DCIE                      2503
#define PWM5INTE_PHIE                 2504
#define PWM5PHIE                      2505
#define PWM5OFIE                      2506
#define PWM5INTE_OFIE                 2507
#define PWM5INTF                      2508
#define PWM5INTF_PRIF                 2509
#define PWM5PRIF                      2510
#define PWM5INTF_DCIF                 2511
#define PWM5DCIF                      2512
#define PWM5INTF_PHIF                 2513
#define PWM5PHIF                      2514
#define PWM5OFIF                      2515
#define PWM5INTF_OFIF                 2516
#define PWM5CLKCON                    2517
#define PWM5CS0                       2518
#define PWM5CLKCON_CS0                2519
#define PWM5CS                        2520
#define PWM5CLKCON_CS                 2521
#define PWM5CS1                       2522
#define PWM5CLKCON_CS1                2523
#define PWM5CS2                       2524
#define PWM5CLKCON_CS2                2525
#define PWM5PS                        2526
#define PWM5CLKCON_PS0                2527
#define PWM5PS0                       2528
#define PWM5CLKCON_PS                 2529
#define PWM5CLKCON_PS1                2530
#define PWM5PS1                       2531
#define PWM5CLKCON_PS2                2532
#define PWM5PS2                       2533
#define PWM5LDCON                     2534
#define PWM5LDCON_LDS                 2535
#define PWM5LDCON_LDS0                2536
#define PWM5LDS                       2537
#define PWM5LDS0                      2538
#define PWM5LDCON_LDT                 2539
#define PWM5LDM                       2540
#define PWM5LDCON_LDA                 2541
#define PWM5LD                        2542
#define PWM5OFCON                     2543
#define PWM5OFCON_OFS0                2544
#define PWM5OFCON_OFS                 2545
#define PWM5OFS0                      2546
#define PWM5OFS                       2547
#define PWM5OFCON_OFO                 2548
#define PWM5OFMC                      2549
#define PWM5OFM                       2550
#define PWM5OFM0                      2551
#define PWM5OFCON_OFM                 2552
#define PWM5OFCON_OFM0                2553
#define PWM5OFM1                      2554
#define PWM5OFCON_OFM1                2555
#define PWM6PHL                       2556
#define PWM6PHL_PH                    2557
#define PWM6PHL0                      2558
#define PWM6PHL1                      2559
#define PWM6PHL2                      2560
#define PWM6PHL3                      2561
#define PWM6PHL4                      2562
#define PWM6PHL5                      2563
#define PWM6PHL6                      2564
#define PWM6PHL7                      2565
#define PWM6PHH0                      2566
#define PWM6PHH                       2567
#define PWM6PHH_PH                    2568
#define PWM6PHH1                      2569
#define PWM6PHH2                      2570
#define PWM6PHH3                      2571
#define PWM6PHH4                      2572
#define PWM6PHH5                      2573
#define PWM6PHH6                      2574
#define PWM6PHH7                      2575
#define PWM6DCL                       2576
#define PWM6DCL_DC                    2577
#define PWM6DCL0                      2578
#define PWM6DCL1                      2579
#define PWM6DCL2                      2580
#define PWM6DCL3                      2581
#define PWM6DCL4                      2582
#define PWM6DCL5                      2583
#define PWM6DCL6                      2584
#define PWM6DCL7                      2585
#define PWM6DCH                       2586
#define PWM6DCH0                      2587
#define PWM6DCH_DC                    2588
#define PWM6DCH1                      2589
#define PWM6DCH2                      2590
#define PWM6DCH3                      2591
#define PWM6DCH4                      2592
#define PWM6DCH5                      2593
#define PWM6DCH6                      2594
#define PWM6DCH7                      2595
#define PWM6PRL0                      2596
#define PWM6PRL                       2597
#define PWM6PRL_PR                    2598
#define PWM6PRL1                      2599
#define PWM6PRL2                      2600
#define PWM6PRL3                      2601
#define PWM6PRL4                      2602
#define PWM6PRL5                      2603
#define PWM6PRL6                      2604
#define PWM6PRL7                      2605
#define PWM6PRH_PR                    2606
#define PWM6PRH                       2607
#define PWM6PRH0                      2608
#define PWM6PRH1                      2609
#define PWM6PRH2                      2610
#define PWM6PRH3                      2611
#define PWM6PRH4                      2612
#define PWM6PRH5                      2613
#define PWM6PRH6                      2614
#define PWM6PRH7                      2615
#define PWM6OFL                       2616
#define PWM6OFL0                      2617
#define PWM6OFL_OF                    2618
#define PWM6OFL1                      2619
#define PWM6OFL2                      2620
#define PWM6OFL3                      2621
#define PWM6OFL4                      2622
#define PWM6OFL5                      2623
#define PWM6OFL6                      2624
#define PWM6OFL7                      2625
#define PWM6OFH                       2626
#define PWM6OFH_OF                    2627
#define PWM6OFH0                      2628
#define PWM6OFH1                      2629
#define PWM6OFH2                      2630
#define PWM6OFH3                      2631
#define PWM6OFH4                      2632
#define PWM6OFH5                      2633
#define PWM6OFH6                      2634
#define PWM6OFH7                      2635
#define PWM6TMRL_TMR                  2636
#define PWM6TMRL                      2637
#define PWM6TMRL0                     2638
#define PWM6TMRL1                     2639
#define PWM6TMRL2                     2640
#define PWM6TMRL3                     2641
#define PWM6TMRL4                     2642
#define PWM6TMRL5                     2643
#define PWM6TMRL6                     2644
#define PWM6TMRL7                     2645
#define PWM6TMRH_TMR                  2646
#define PWM6TMRH0                     2647
#define PWM6TMRH                      2648
#define PWM6TMRH1                     2649
#define PWM6TMRH2                     2650
#define PWM6TMRH3                     2651
#define PWM6TMRH4                     2652
#define PWM6TMRH5                     2653
#define PWM6TMRH6                     2654
#define PWM6TMRH7                     2655
#define PWM6CON                       2656
#define PWM6CON_MODE0                 2657
#define PWM6CON_MODE                  2658
#define PWM6MODE                      2659
#define PWM6MODE0                     2660
#define PWM6CON_MODE1                 2661
#define PWM6MODE1                     2662
#define PWM6POL                       2663
#define PWM6CON_POL                   2664
#define PWM6OUT                       2665
#define PWM6CON_OUT                   2666
#define PWM6EN                        2667
#define PWM6CON_EN                    2668
#define PWM6INTE                      2669
#define PWM6PRIE                      2670
#define PWM6INTE_PRIE                 2671
#define PWM6DCIE                      2672
#define PWM6INTE_DCIE                 2673
#define PWM6PHIE                      2674
#define PWM6INTE_PHIE                 2675
#define PWM6INTE_OFIE                 2676
#define PWM6OFIE                      2677
#define PWM6INTF                      2678
#define PWM6INTF_PRIF                 2679
#define PWM6PRIF                      2680
#define PWM6INTF_DCIF                 2681
#define PWM6DCIF                      2682
#define PWM6PHIF                      2683
#define PWM6INTF_PHIF                 2684
#define PWM6OFIF                      2685
#define PWM6INTF_OFIF                 2686
#define PWM6CLKCON                    2687
#define PWM6CLKCON_CS                 2688
#define PWM6CS                        2689
#define PWM6CLKCON_CS0                2690
#define PWM6CS0                       2691
#define PWM6CLKCON_CS1                2692
#define PWM6CS1                       2693
#define PWM6CLKCON_CS2                2694
#define PWM6CS2                       2695
#define PWM6PS                        2696
#define PWM6PS0                       2697
#define PWM6CLKCON_PS0                2698
#define PWM6CLKCON_PS                 2699
#define PWM6PS1                       2700
#define PWM6CLKCON_PS1                2701
#define PWM6CLKCON_PS2                2702
#define PWM6PS2                       2703
#define PWM6LDCON                     2704
#define PWM6LDS                       2705
#define PWM6LDCON_LDS                 2706
#define PWM6LDCON_LDS0                2707
#define PWM6LDS0                      2708
#define PWM6LDCON_LDT                 2709
#define PWM6LDM                       2710
#define PWM6LD                        2711
#define PWM6LDCON_LDA                 2712
#define PWM6OFCON                     2713
#define PWM6OFS0                      2714
#define PWM6OFCON_OFS                 2715
#define PWM6OFCON_OFS0                2716
#define PWM6OFS                       2717
#define PWM6OFCON_OFO                 2718
#define PWM6OFMC                      2719
#define PWM6OFM                       2720
#define PWM6OFCON_OFM                 2721
#define PWM6OFM0                      2722
#define PWM6OFCON_OFM0                2723
#define PWM6OFM1                      2724
#define PWM6OFCON_OFM1                2725
#define PPSLOCK                       2726
#define PPSLOCKED                     2727
#define INTPPS                        2728
#define T0CKIPPS                      2729
#define T1CKIPPS                      2730
#define T1GPPS                        2731
#define CCP1PPS                       2732
#define CCP2PPS                       2733
#define COG1INPPS                     2734
#define COG2INPPS                     2735
#define T2INPPS                       2736
#define T3CKIPPS                      2737
#define T3GPPS                        2738
#define T4INPPS                       2739
#define T5CKIPPS                      2740
#define T5GPPS                        2741
#define T6INPPS                       2742
#define SSPCLKPPS                     2743
#define SSPDATPPS                     2744
#define SSPSSPPS                      2745
#define RXPPS                         2746
#define CKPPS                         2747
#define CLCIN0PPS                     2748
#define CLCIN1PPS                     2749
#define CLCIN2PPS                     2750
#define CLCIN3PPS                     2751
#define PRG1RPPS                      2752
#define PRG1FPPS                      2753
#define PRG2RPPS                      2754
#define PRG2FPPS                      2755
#define MD1CHPPS                      2756
#define MD1CLPPS                      2757
#define MD1MODPPS                     2758
#define MD2CHPPS                      2759
#define MD2CLPPS                      2760
#define MD2MODPPS                     2761
#define RA0PPS                        2762
#define RA1PPS                        2763
#define RA2PPS                        2764
